Diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>BKM_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BKM_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>BKM_СуммаЕжемесячнойАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BKM_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>BKM_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
// Доработка BKM Начало
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание") Тогда
		
		Если ЭтаФорма.Элементы.Найти("ДатаНачалаДействияДоговора") = Неопределено Тогда
			BKM_ДобавитьПоляДляАбонентскогоДоговора();
		Иначе
			ЭтаФорма.Элементы.ДатаНачалаДействияДоговора.Видимость = Истина;
			ЭтаФорма.Элементы.ДатаОкончанияДействияДоговора.Видимость = Истина;
			ЭтаФорма.Элементы.СуммаЕжемесячнойАбонентскойПлаты.Видимость = Истина;
			ЭтаФорма.Элементы.СтоимостьЧасаРаботыСпециалиста.Видимость = Истина;
			
		КонецЕсли;
	Иначе 
			ЭтаФорма.Элементы.ДатаНачалаДействияДоговора.Видимость = Ложь;
			Объект.BKM_ДатаНачалаДействияДоговора = 0;	
			
			ЭтаФорма.Элементы.ДатаОкончанияДействияДоговора.Видимость = Ложь;
			Объект.BKM_ДатаОкончанияДействияДоговора = 0;
			
			ЭтаФорма.Элементы.СуммаЕжемесячнойАбонентскойПлаты.Видимость = Ложь;
			Объект.BKM_СуммаЕжемесячнойАбонентскойПлаты = 0;
			
			ЭтаФорма.Элементы.СтоимостьЧасаРаботыСпециалиста.Видимость = Ложь;
			Объект.BKM_СтоимостьЧасаРаботыСпециалиста = 0;
					
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание") Тогда
			BKM_ДобавитьПоляДляАбонентскогоДоговора();
КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура BKM_ДобавитьПоляДляАбонентскогоДоговора()
	
	ПолеВводаДатаНачалаДоговора = ЭтаФорма.Элементы.Добавить("ДатаНачалаДействияДоговора", Тип("ПолеФормы"));
	ПолеВводаДатаНачалаДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаДатаНачалаДоговора.ПутьКДанным = "Объект.BKM_ДатаНачалаДействияДоговора";	 
	
	ПолеВводаДатаОкончанияДоговора = ЭтаФорма.Элементы.Добавить("ДатаОкончанияДействияДоговора", Тип("ПолеФормы"));
	ПолеВводаДатаОкончанияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаДатаОкончанияДоговора.ПутьКДанным = "Объект.BKM_ДатаОкончанияДействияДоговора";
	ПолеВводаДатаОкончанияДоговора.УстановитьДействие("ПриИзменении","ПриИзмененииДатыОкончанияДоговора");
	
	
	ПолеВводаСуммаЕжемесячнойАбонентскойПлаты = ЭтаФорма.Элементы.Добавить("СуммаЕжемесячнойАбонентскойПлаты", Тип("ПолеФормы"));
	ПолеВводаСуммаЕжемесячнойАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаСуммаЕжемесячнойАбонентскойПлаты.ПутьКДанным = "Объект.BKM_СуммаЕжемесячнойАбонентскойПлаты";	
	
	ПолеВводаСтоимостьЧасаРаботыСпециалиста = ЭтаФорма.Элементы.Добавить("СтоимостьЧасаРаботыСпециалиста", Тип("ПолеФормы"));
	ПолеВводаСтоимостьЧасаРаботыСпециалиста.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаСтоимостьЧасаРаботыСпециалиста.ПутьКДанным = "Объект.BKM_СтоимостьЧасаРаботыСпециалиста";	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДатыОкончанияДоговора()
	ПриИзмененииДатыОкончанияДоговораНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДатыОкончанияДоговораНаСервере()
	Объект.BKM_ДатаОкончанияДействияДоговора = КонецДня(Объект.BKM_ДатаОкончанияДействияДоговора); 
КонецПроцедуры

// Доработка BKM Конец
